# RegisterPointCloudEngine Method (2023)

---
C#Visual BasicVisual C++
Revit 2023 API
---
PointCloudEngineRegistry..::..RegisterPointCloudEngine Method
PointCloudEngineRegistry Class See Also
---
Registers a new point cloud engine and associates it to a particular file extension.
**Namespace:** Autodesk.Revit.DB.PointClouds**Assembly:** RevitAPI (in RevitAPI.dll) Version: 23.0.0.0 (23.1.0.0)**Since:** 2012
# Syntax
C#
---
```text
public static void RegisterPointCloudEngine(
	string identifier,
	IPointCloudEngine engine,
	bool isFileBased
)
```

Visual Basic
---
```text
Public Shared Sub RegisterPointCloudEngine ( _
	identifier As String, _
	engine As IPointCloudEngine, _
	isFileBased As Boolean _
)
```

Visual C++
---
```text
public:
static void RegisterPointCloudEngine(
	String^ identifier,
	IPointCloudEngine^ engine,
	bool isFileBased
)
```

# ### Parameters
identifier
    Type: System..::..String A string that distinguishes the engine being registered. If isFileBased is true, this should be the file extension (e.g. "pcg"). If isFileBased is false, this identifier is used only by API calls and should be unique.
engine
    Type: Autodesk.Revit.DB.PointClouds..::..IPointCloudEngine The point cloud engine that governs point clouds matching the input identifier.
isFileBased
    Type: System..::..Boolean Indicates to Revit if a single Point Cloud corresponds to a single file on disk.
# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | The same identifier has already been registered by another engine. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | A non-optional argument was null |

# See Also
PointCloudEngineRegistry Class
Autodesk.Revit.DB.PointClouds Namespace